Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

## Persiapan Data Frame

In [4]:
n_rows=10
n_cols =1
cols=('usia',)

df=pd.DataFrame(np.random.randint(1,99,size=(n_rows,n_cols)),
               columns=cols)

df

   usia
0    59
1     6
2    82
3    19
4    35
5    41
6    98
7    72
8    86
9    92

## Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut ()

In [5]:
df['Kelompok_usia'] =pd.cut(df['usia'],
                           bins=[0,18,65,99],
                           labels=['anak','dewasa','Manula'])

df

   usia Kelompok_usia
0    59        dewasa
1     6          anak
2    82        Manula
3    19        dewasa
4    35        dewasa
5    41        dewasa
6    98        Manula
7    72        Manula
8    86        Manula
9    92        Manula